{
    "introduction": {
        "title": "Ich bin Julius",
        "titleCaption": "Ein aufstrebender Programmierer",

        "middleContainer":  {
            "header1": "Ich bin 18 Jahre alt und lerne gerade WebDevelopment",
            "header2": "Momentan habe ich Erfahrung mit Java, C++, und C#."
        },

        "about":  {
            "header": "Über diese Website",
            "text": "Diese Website läuft mit einer Kombination aus TypeScript, Node, Bootstrap und Angular. Sie ist ein Projekt das dazu diente, meine WebDevelopment Fähigkeiten zu verbessern. Mein Ziel ist es mir Grundkenntnisse in Node, Bootstrap und Angular anzueignen, da ich bis jetzt nur selten mit etwas außer JavaScript/TypeScript, HTML und CSS gearbeitet habe."
        },

        "use":  {
            "header":"Der Nutzen dieser Website",
            "text": "Diese Website war zwar auch als Übung für mich selbst gedacht, sollte allerdings auch dazu dienen etwas zu haben, dass Leuten eine grobe Idee von meinen Fähigkeiten gibt, auch als eine Art Bewerbung.  Da dies also auch eine Form der Bewerbung ist gibt es hier auch einiges über mich zu lesen. Aber da diese Website frei zugänglich für jeden ist, habe ich auf private Informationen verzichtet. Damit möchte ich Sie dazu einladen, meine Website zu erkunden und einen Blick auf meine bisherigen Projekte zu werfen. Die deutsche Übersetzung ist neu und noch nicht ganz fertig, es kann sein, dass hier und da noch Englische Inhalte zu finden sind."
        },

        "credit":   {
            "madeBy1": "Java Icon gemacht von",
            "madeBy2": "Freepik",
            "madeBy3": "auf",
            "madeBy4": "www.flaticon.com"
        }
    },

    "aboutMe":  {
        "whoAmI":   {
            "title": "Wer bin ich?",
            "text": "Mein Name ist Julius Langenberg. Ich bin ein 18 Jahre alter Schüler an einer Fachhochschule für Technologie. Ich hatte schon immer eine Affinität für digitale Technologien und habe mich dazu entschieden einen Beruf im Bereich IT zu anzustreben. Deshalb bin ich auf meine momentane Schule gewechselt, da sie gerade im Vergleich zu meiner alten Schule eine große Auswahl an IT-Themen unterrichtet."
        },

        "hobbies":  {
            "title": "Meine Hobbies",
            "designDevelopment":    {
                "title": "Design und Entwicklung",
                "text": "Mein Interesse an Programmierung kam ursprünglich von dem Wunsch, meine eigenen Computerspiele zu entwickeln. Nach dem Unterricht in der Schule und dem auseinandersetzen mit Privaten Interessen, habe ich jetzt ein grundlegendes Verständnis der Softwareentwicklung und lerne immer noch jeden Tag etwas dazu. Zwei meiner privaten Interessen sind das modifizieren von Spielen und die eigene Entwicklung von neuen, kleinen Spielen."
            },
            "playingPiano": {
                "title": "Klavier spielen",
                "text": "Ich hatte immer Spaß daran Musik zu hören. Irgendwann war mir das nicht mehr genug, und ich wollte selber welch machen. Klavier spielen lernen macht viel Spaß, aber es bringt einem auch Disziplin bei. Aber auch lernt man, dass sich üben auszahlt und ohne Übung sogar talentierte Menschen nicht sehr weit kommen."
            },
            "playingRocketLeague": {
                "title": "Rocket League spielen",
                "text": "Rocket League bringt mir nicht nur bei mit Fremden effizient im Team zu arbeiten, es bringt mir auch bei Ruhig zu bleiben, auch wenn ich verliere."
            },
            "cooking": {
                "title": "Kochen",
                "text": "Ich habe mit ungefähr 13 Jahren zu kochen angefangen. Da meine Fähigkeiten zu kochen noch sehr eingeschränkt waren, stellte sich bei den immergleichen Gerichten schnell langeweile ein. Mit der Zeit habe ich nicht nur eine Menge neue Rezepte gelernt, sondern habe auch eine Liebe zum ausprobieren von neuen Gerichten entdeckt. Ich glaube, eine gesunde Ernährung sind ein wichtiger Teil einer gesunden Lebensweise und sehr wichtig um gute Leistungen erbringen zu können. Auch habe ich festgestellt, dass Kochen ein sehr entspannendes Hobby ist, das besonders mit Freunden oder für Freunde Spaß macht."
            }
        },

        "credit":   {
            "p1": "Code,",
            "p2": "Klavier,",
            "p3": "Auto",
            "p4": "und",
            "p5": "Essen",
            "p6": "Icon made by",
            "p7": "auf"
        }
    },

    "myProjects":    {
        "main": {
            "title": "Meine Projekte",
            "text": "Da ich noch kein Profi bin, habe ich nicht besonders viele beeindruckende Projekte, aber was ich habe sind ein paar Aufgaben aus einem Praktikum, aus meiner Schule und das ein oder andere private Projekt. Auf meinem GitHub Profil gibt es auch Projekte, die hier nicht aufgeführt sind.",

            "typeScript":   {
                "title": "TypeScript Applikationen",
                "errorMsg": "Seitdem Übersetzungen hinzugefügt wurden, funktionieren diese Anwendungen nur, wenn die Sprache aktualisiert wird. Ich arbeite an einem Fix.",
                "project1": "Ist es ein Isogramm?",
                "project2": "Ein String umdrehen",
                "project3": "Diamanten herstellen"
            },

            "java": {
                "title": "Java Applikationen",
                "project1": "Lernstandserhebung-Datenbank",
                "project2": "Chat"
            },

            "csharp":   {
                "title": "C# Applikationen",
                "project1": "Rectumble"
            },

            "cpp":  {
                "title": "C++ Applikationen",
                "filler": "Ich muss hier noch ein paar Projekte aus der 11ten Klasse auflisten, oder neue Anfangen die ich dann hier eintragen kann. Diese Website ist immerhin noch nicht fertig und wird laufend verändert."
            }
        }
    },

    "header":   {
        "main": "Hauptseite",
        "aboutMe": "Über mich",
        "myProjects": "Meine Projekte"
    },

    "footer":   {
        "title": "Kontakt",
        "caption": "Ich bin immer an neuen Möglichkeiten zu lernen interessiert.",
        "mail": "E-Mail",
        "github": "GitHub Profil"
    },

    "csharp": {
        "title": "Rectumble",
        "text1": "Unity verfügt über eine große Auswahl and Funktionen die die Entwicklung von kleinen Spielen vereinfacht, solange man auch alle relevanten Funktionen kennt. Rectumble ist mein einziges fertiges Spiel in Unity. Es funktioniert mit Code der in C# geschrieben ist.",
        "text2": "In Rectumble kontrolliert der Spieler einen kleinen Würfel, schlittert über die Bahn und muss währenddessen anderen Würfel ausweichen. Durch das Erfolgreiche abschließen eines Levels beginnt sofort das andere. Es beinhaltet 5 kleine Level, jedes schwerer als das letzte.",
        "text3": "Die Entwicklung von neuen Ideen und Levels macht mir viel Spaß und schrecke nicht vor Dingen zurück nur weil mir noch nicht klar wie ich sie umsetzen könnte. In so einem Fall recherchiere ich einfach online und suche nach Möglichkeiten zur Umsetzung. Diese Tüftlerei macht mir viel Spaß und ist sehr belohnend wenn es dann endlich funktioniert."
    },

    "java":{
        "title": "Java Anwendungen",
        "schooldb": {
            "title": "Lernstandserhebungs-Datenbank",
            "text": "Dieses Schulprojekt war eines der größten Java Projekte die ich jemals gemacht habe. Wir haben zwar nicht mit SQL gearbeitet, aber es war trotzdem das erste mal, dass ich das Gelernte zu Datenbanken anwenden konnte. Die Aufgabe war, ein Programm zu schreiben das Informationen über Schüler, ihre Klausuren und Lehrer speichern sollte. Nachdem ich mit dem Programm fertig war hatte ich das Gefühl, dass es noch viel Luft nach oben gab, also habe ich es neu strukturiert. Am Ende hatte ich eine sehr flexible Datenbank, die auch neue Einträge annehmen konnte."
        },

        "chat": {
            "title": "Chat Anwendungen",
            "text": "Diese Anwendung war für unsere Klasse die Einführung zur Netzwerkprogrammierung. Das Ziel war es, einen Server und einen Client zu erstellen mit dem man im lokalen Schulnetzwer miteinander chatten kann. Die erste Version dieser Anwendungen lief nur in der Konsole, und konnte auch nur Nachrichten lesen, wenn sie selber welche verschickte. Deshalb waren wir gezwungen, uns mit Threads auseinanderzusetzen. Nun hat dieses Programm nur noch wenige Bugs, und eine Grafische Oberfläche. Dieses Projekt befindet sich noch immer in der Entwicklung. Es befindet sich in einem GitHub-Repository.",
            "linkserver": "Der Chat Server ist hier",
            "linkclient": "Der Chat Client ist hier."
        }
    },

    "diamond":  {
        "title": "Diamantinator",
        "caption": "Wie groß soll Ihr Diamant sein?",
        "button": "Diamanten erstellen"
    },

    "isogramm":  {
        "title": "Isogramminator",
        "caption": "Geben Sie hier Text ein um zu überprüfen ob es ein Isogramm ist!",
        "button": "Testen"
    },

    "reverse":  {
        "title": "Umdrehinator",
        "caption": "Geben Sie hier Ihren Text ein um ihn umzudrehen!",
        "button": "Drehen"
    }
}
